zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph2/PERI_AIPS.h
#define AIPS_OPACRI_SP3_MASK                     (0x40000U)
#define AIPS_OPACRI_SP3_SHIFT                    (18U)
/*! SP3 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRI_SP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_SP3_SHIFT)) & AIPS_OPACRI_SP3_MASK)

#define AIPS_OPACRI_TP1_MASK                     (0x1000000U)
#define AIPS_OPACRI_TP1_SHIFT                    (24U)
/*! TP1 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRI_TP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_TP1_SHIFT)) & AIPS_OPACRI_TP1_MASK)

#define AIPS_OPACRI_WP1_MASK                     (0x2000000U)
#define AIPS_OPACRI_WP1_SHIFT                    (25U)
/*! WP1 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRI_WP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_WP1_SHIFT)) & AIPS_OPACRI_WP1_MASK)

#define AIPS_OPACRI_SP1_MASK                     (0x4000000U)
#define AIPS_OPACRI_SP1_SHIFT                    (26U)
/*! SP1 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRI_SP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRI_SP1_SHIFT)) & AIPS_OPACRI_SP1_MASK)
/*! @} */

/*! @name OPACRJ - Off-Platform Peripheral Access Control Register */
/*! @{ */

#define AIPS_OPACRJ_TP7_MASK                     (0x1U)
#define AIPS_OPACRJ_TP7_SHIFT                    (0U)
/*! TP7 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRJ_TP7(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_TP7_SHIFT)) & AIPS_OPACRJ_TP7_MASK)

#define AIPS_OPACRJ_WP7_MASK                     (0x2U)
#define AIPS_OPACRJ_WP7_SHIFT                    (1U)
/*! WP7 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRJ_WP7(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_WP7_SHIFT)) & AIPS_OPACRJ_WP7_MASK)

#define AIPS_OPACRJ_SP7_MASK                     (0x4U)
#define AIPS_OPACRJ_SP7_SHIFT                    (2U)
/*! SP7 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRJ_SP7(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_SP7_SHIFT)) & AIPS_OPACRJ_SP7_MASK)

#define AIPS_OPACRJ_TP6_MASK                     (0x10U)
#define AIPS_OPACRJ_TP6_SHIFT                    (4U)
/*! TP6 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRJ_TP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_TP6_SHIFT)) & AIPS_OPACRJ_TP6_MASK)

#define AIPS_OPACRJ_WP6_MASK                     (0x20U)
#define AIPS_OPACRJ_WP6_SHIFT                    (5U)
/*! WP6 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRJ_WP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_WP6_SHIFT)) & AIPS_OPACRJ_WP6_MASK)

#define AIPS_OPACRJ_SP6_MASK                     (0x40U)
#define AIPS_OPACRJ_SP6_SHIFT                    (6U)
/*! SP6 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRJ_SP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_SP6_SHIFT)) & AIPS_OPACRJ_SP6_MASK)

#define AIPS_OPACRJ_TP4_MASK                     (0x1000U)
#define AIPS_OPACRJ_TP4_SHIFT                    (12U)
/*! TP4 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRJ_TP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_TP4_SHIFT)) & AIPS_OPACRJ_TP4_MASK)

#define AIPS_OPACRJ_WP4_MASK                     (0x2000U)
#define AIPS_OPACRJ_WP4_SHIFT                    (13U)
/*! WP4 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRJ_WP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_WP4_SHIFT)) & AIPS_OPACRJ_WP4_MASK)

#define AIPS_OPACRJ_SP4_MASK                     (0x4000U)
#define AIPS_OPACRJ_SP4_SHIFT                    (14U)
/*! SP4 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRJ_SP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_SP4_SHIFT)) & AIPS_OPACRJ_SP4_MASK)

#define AIPS_OPACRJ_TP3_MASK                     (0x10000U)
#define AIPS_OPACRJ_TP3_SHIFT                    (16U)
/*! TP3 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRJ_TP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_TP3_SHIFT)) & AIPS_OPACRJ_TP3_MASK)

#define AIPS_OPACRJ_WP3_MASK                     (0x20000U)
#define AIPS_OPACRJ_WP3_SHIFT                    (17U)
/*! WP3 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRJ_WP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_WP3_SHIFT)) & AIPS_OPACRJ_WP3_MASK)

#define AIPS_OPACRJ_SP3_MASK                     (0x40000U)
#define AIPS_OPACRJ_SP3_SHIFT                    (18U)
/*! SP3 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRJ_SP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_SP3_SHIFT)) & AIPS_OPACRJ_SP3_MASK)

#define AIPS_OPACRJ_TP2_MASK                     (0x100000U)
#define AIPS_OPACRJ_TP2_SHIFT                    (20U)
/*! TP2 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRJ_TP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRJ_TP2_SHIFT)) & AIPS_OPACRJ_TP2_MASK)

