zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph2/PERI_AIPS.h
#define AIPS_OPACRL_TP6_MASK                     (0x10U)
#define AIPS_OPACRL_TP6_SHIFT                    (4U)
/*! TP6 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRL_TP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRL_TP6_SHIFT)) & AIPS_OPACRL_TP6_MASK)

#define AIPS_OPACRL_WP6_MASK                     (0x20U)
#define AIPS_OPACRL_WP6_SHIFT                    (5U)
/*! WP6 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRL_WP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRL_WP6_SHIFT)) & AIPS_OPACRL_WP6_MASK)

#define AIPS_OPACRL_SP6_MASK                     (0x40U)
#define AIPS_OPACRL_SP6_SHIFT                    (6U)
/*! SP6 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRL_SP6(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRL_SP6_SHIFT)) & AIPS_OPACRL_SP6_MASK)

#define AIPS_OPACRL_TP5_MASK                     (0x100U)
#define AIPS_OPACRL_TP5_SHIFT                    (8U)
/*! TP5 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRL_TP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRL_TP5_SHIFT)) & AIPS_OPACRL_TP5_MASK)

#define AIPS_OPACRL_WP5_MASK                     (0x200U)
#define AIPS_OPACRL_WP5_SHIFT                    (9U)
/*! WP5 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRL_WP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRL_WP5_SHIFT)) & AIPS_OPACRL_WP5_MASK)

#define AIPS_OPACRL_SP5_MASK                     (0x400U)
#define AIPS_OPACRL_SP5_SHIFT                    (10U)
/*! SP5 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRL_SP5(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRL_SP5_SHIFT)) & AIPS_OPACRL_SP5_MASK)

#define AIPS_OPACRL_TP1_MASK                     (0x1000000U)
#define AIPS_OPACRL_TP1_SHIFT                    (24U)
/*! TP1 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRL_TP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRL_TP1_SHIFT)) & AIPS_OPACRL_TP1_MASK)

#define AIPS_OPACRL_WP1_MASK                     (0x2000000U)
#define AIPS_OPACRL_WP1_SHIFT                    (25U)
/*! WP1 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRL_WP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRL_WP1_SHIFT)) & AIPS_OPACRL_WP1_MASK)

#define AIPS_OPACRL_SP1_MASK                     (0x4000000U)
#define AIPS_OPACRL_SP1_SHIFT                    (26U)
/*! SP1 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRL_SP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRL_SP1_SHIFT)) & AIPS_OPACRL_SP1_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group AIPS_Register_Masks */


/*!
 * @}
 */ /* end of group AIPS_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_AIPS_H_ */

